In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'A' : [1,2,np.nan,4,5],
    'B' : [1,2,3,4,5],
    'C': [1, 2, 3, np.nan, np.nan],
    'D': [1, np.nan, np.nan, np.nan, 5]
}
df = pd.DataFrame(data)
df

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
2  NaN  3  3.0  NaN
3  4.0  4  NaN  NaN
4  5.0  5  NaN  5.0

FINDING MISSING DATA:

In [19]:
df.isna().sum() 
# this shows how many null numbers are in each column

A    1
B    0
C    2
D    3
dtype: int64

In [18]:
df.isna().any()
# this tells us there is a null value present in every column

A     True
B    False
C     True
D     True
dtype: bool

REMOVING MISSING DATA:

In [ ]:
df.dropna()
# this drops any row with a null value

     A  B    C    D
0  1.0  1  1.0  1.0

In [24]:
df.dropna(thresh=3)
# it doesn't remove the rows where you must have 3 or more non-null values, but does its vice-versa

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  NaN
4  5.0  5  NaN  5.0

FILLING THE MISSING DATA:

In [25]:
df.fillna(0)
# replace the nan vale with 0

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  0.0
2  0.0  3  3.0  0.0
3  4.0  4  0.0  0.0
4  5.0  5  0.0  5.0

In [29]:
values = {'A':0,'B':100,'C':377,'D':699}
df.fillna(value = values)
# we can customise to put the different values in the replacement of nan

     A  B      C      D
0  1.0  1    1.0    1.0
1  2.0  2    2.0  699.0
2  0.0  3    3.0  699.0
3  4.0  4  377.0  699.0
4  5.0  5  377.0    5.0

In [33]:
df.fillna(df.mean())
# we can also replace nan with the overall mean value

     A  B    C    D
0  1.0  1  1.0  1.0
1  2.0  2  2.0  3.0
2  3.0  3  3.0  3.0
3  4.0  4  2.0  3.0
4  5.0  5  2.0  5.0